In [1]:
from __future__ import print_function

import pandas as pd
pd.__version__

'0.22.0'

In [2]:
pd.Series(['Pune','Delhi','Chennai'])

0       Pune
1      Delhi
2    Chennai
dtype: object

In [4]:
city_names = pd.Series(['Pune','Delhi','Chennai','Jaipur'])
population = pd.Series([123123,234234,345345])

pd.DataFrame({'City Names': city_names, 'Population': population})

  City Names  Population
0       Pune    123123.0
1      Delhi    234234.0
2    Chennai    345345.0
3     Jaipur         NaN

In [6]:
cal_housing_dataframe = pd.read_csv("https://download.mlcc.google.com/mledu-datasets/california_housing_train.csv", sep=",")
cal_housing_dataframe.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000
mean,-119.562108,35.625225,28.589353,2643.664412,539.410824,1429.573941,501.221941,3.883578,207300.912353
std,2.005166,2.137340,12.586937,2179.947071,421.499452,1147.852959,384.520841,1.908157,115983.764387
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.790000,33.930000,18.000000,1462.000000,297.000000,790.000000,282.000000,2.566375,119400.000000
50%,-118.490000,34.250000,29.000000,2127.000000,434.000000,1167.000000,409.000000,3.544600,180400.000000
75%,-118.000000,37.720000,37.000000,3151.250000,648.250000,1721.000000,605.250000,4.767000,265000.000000
max,-114.310000,41.950000,52.000000,37937.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [7]:
cal_housing_dataframe.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0

In [8]:
cal_housing_dataframe.hist('housing_median_age')

array([[<matplotlib.axes._subplots.AxesSubplot object at 0x7f0810fa2a58>]],
      dtype=object)

In [11]:
cities = pd.DataFrame({'city name': city_names, 'population': population})
print (type(cities['city name']))
cities['city name']

<class 'pandas.core.series.Series'>

0       Pune
1      Delhi
2    Chennai
3     Jaipur
Name: city name, dtype: object

In [12]:
print (type(cities['city name'][1]))
cities['city name'][1]

<class 'str'>

'Delhi'

In [14]:
print (type(cities[0:2]))
cities[0:2]

<class 'pandas.core.frame.DataFrame'>

  city name  population
0      Pune    123123.0
1     Delhi    234234.0

In [15]:
population/1000

0    123.123
1    234.234
2    345.345
dtype: float64

In [16]:
import numpy as np
np.log(population)

0    11.720939
1    12.364076
2    12.752299
dtype: float64

In [17]:
population.apply(lambda val: val >100000)

0    True
1    True
2    True
dtype: bool

In [18]:
cities['Area square miles'] = pd.Series([23.32,121.23,56.34])
cities['population density'] = cities['population']/cities['Area square miles']
cities

  city name  population  Area square miles  population density
0      Pune    123123.0              23.32         5279.716981
1     Delhi    234234.0             121.23         1932.145509
2   Chennai    345345.0              56.34         6129.659212
3    Jaipur         NaN                NaN                 NaN

In [22]:
cities['is wide and has saint name'] = (cities['Area square miles'] > 50) & cities['city name'].apply(lambda name: name.startswith('San'))
cities

,city name,population,Area square miles,population density,is wide and has saint name
0,Pune,123123.0,23.32,5279.716981,False
1,Delhi,234234.0,121.23,1932.145509,False
2,Chennai,345345.0,56.34,6129.659212,False
3,Jaipur,NaN,NaN,NaN,False

In [24]:
city_names.index

RangeIndex(start=0, stop=4, step=1)

In [25]:
cities.index

RangeIndex(start=0, stop=4, step=1)

In [27]:
cities.reindex([2,0,1])

,city name,population,Area square miles,population density,is wide and has saint name
2,Chennai,345345.0,56.34,6129.659212,False
0,Pune,123123.0,23.32,5279.716981,False
1,Delhi,234234.0,121.23,1932.145509,False

In [35]:
cities.reindex(np.random.permutation(cities.index))

,city name,population,Area square miles,population density,is wide and has saint name
3,Jaipur,NaN,NaN,NaN,False
2,Chennai,345345.0,56.34,6129.659212,False
1,Delhi,234234.0,121.23,1932.145509,False
0,Pune,123123.0,23.32,5279.716981,False